{
  "backend/main.mo": "Motoko canister handling jobs, contact requests, user profiles, and admin/user authorization with add/update job operations and profile management.",
  "feature_evidence.json": "Feature evidence report mapping product features to source files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Pre-written summaries describing responsibilities of various frontend files including components, hooks, and config utilities.",
  "frontend/index.css": "Tailwind base configuration defining OKLCH color variables, theming for light/dark modes, and global background/foreground styles.",
  "frontend/index.html": "Root HTML document with metadata, favicon, SEO description, and script loading the React entry point.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes for all pages and wraps them in the SiteLayout, including protected admin route.",
  "frontend/src/components/admin/AdminRouteGuard.tsx": "Component that checks authentication and admin status, showing login or access-denied states before rendering protected content.",
  "frontend/src/components/admin/ContactRequestsList.tsx": "Admin table listing contact form submissions with loading, error, and empty states using React Query data.",
  "frontend/src/components/admin/JobEditorDialog.tsx": "Dialog form for creating or editing jobs, handling form state, category mapping, and submit mutations.",
  "frontend/src/components/auth/AuthButtons.tsx": "Login/logout button using Internet Identity with automatic session handling and query cache reset.",
  "frontend/src/components/common/EmptyState.tsx": "Reusable empty state component displaying an icon, title, description, and optional action.",
  "frontend/src/components/contact/ContactForm.tsx": "Contact form that submits user details via a mutation and shows success or error alerts.",
  "frontend/src/components/contact/FloatingWhatsAppFab.tsx": "Floating WhatsApp button that opens a prefilled chat using configured phone number and message.",
  "frontend/src/components/contact/WhatsAppButton.tsx": "Button that opens WhatsApp with a custom or default prefilled message.",
  "frontend/src/components/jobs/FeaturedJobsSection.tsx": "Section that lists active jobs with pagination, loading skeletons, and empty/error states.",
  "frontend/src/components/jobs/JobCard.tsx": "Card displaying job details and an Apply Now button that triggers the apply form.",
  "frontend/src/components/layout/Footer.tsx": "Footer with company info, navigation links, social links, and branding credits.",
  "frontend/src/components/layout/Header.tsx": "Responsive site header with navigation, admin access, auth buttons, and mobile drawer menu.",
  "frontend/src/components/layout/SiteLayout.tsx": "Page layout wrapping content with header, footer, and a floating WhatsApp FAB.",
  "frontend/src/config/krStaffing.ts": "Configuration for Google Form prefills, WhatsApp contact info, and social links.",
  "frontend/src/content/copy.ts": "Provides static text content for the site including hero text, categories, testimonials, about, contact, privacy, and terms sections.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance tied to the user's Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAdminJobs.ts": "Defines admin-focused hooks for adding, updating, activating, deactivating jobs, seeding example jobs, and fetching contact requests.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, handling login, logout, identity loading, and exposing identity state through a provider and hook.",
  "frontend/src/hooks/useQueries.ts": "Provides user-facing data hooks for fetching active jobs, profiles, admin status, submitting contact forms, and saving user profiles.",
  "frontend/src/index.css": "Configures Tailwind CSS base styles and custom CSS variables for theming, including light and dark modes.",
  "frontend/src/lib/applyNow.ts": "Builds and opens a prefilled Google Form URL for job applications based on job title and city.",
  "frontend/src/lib/categories.ts": "Defines job category metadata and utilities for looking up categories and labels used throughout the UI.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page using copy content split into paragraphs inside a styled card.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard for managing jobs, seeding examples, editing entries, and reviewing contact requests.",
  "frontend/src/pages/CategoriesPage.tsx": "Displays job categories as cards and navigates to filtered job listings when a category is selected.",
  "frontend/src/pages/ContactPage.tsx": "Renders a contact page with WhatsApp quick support and a contact form inside UI cards.",
  "frontend/src/pages/HomePage.tsx": "Displays the homepage with a hero search form, popular searches, categories, featured jobs, and contact options.",
  "frontend/src/pages/JobsPage.tsx": "Provides job search and filtering with keyword, city, and category, showing paginated job results.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Shows the privacy policy content by rendering formatted paragraphs and section headers.",
  "frontend/src/pages/TermsPage.tsx": "Displays the terms of service, splitting and formatting content into paragraphs and headings.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, animations, and plugins like typography and container queries.",
  "project_state.json": "Defines the project’s state, goals, design guidelines, image requirements, and a list of existing planned features for building the KR Staffing mobile‑first job portal."
}