{
  "backend/main.mo": "Motoko backend defining jobs, contact requests, user profiles, and admin‑protected CRUD operations with authorization checks.",
  "feature_evidence.json": "Feature evidence report listing two branding-related features and their associated components and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of many frontend files covering routing, UI components, hooks, branding, and copy modules.",
  "frontend/index.css": "Tailwind base/theme stylesheet defining OKLCH color variables for light and dark modes with global border/background settings.",
  "frontend/index.html": "HTML entry file loading the React app and referencing the generated favicon path.",
  "frontend/src/App.tsx": "Sets up TanStack Router with all site routes wrapped in SiteLayout and includes admin route protection.",
  "frontend/src/components/admin/AdminRouteGuard.tsx": "Checks Internet Identity login and admin permissions, gating access to admin pages with appropriate UI states.",
  "frontend/src/components/admin/ContactRequestsList.tsx": "Displays contact requests in a table with loading, error, and empty states using React Query.",
  "frontend/src/components/admin/JobEditorDialog.tsx": "Dialog for adding or editing jobs with form handling, category mapping, and backend mutations.",
  "frontend/src/components/auth/AuthButtons.tsx": "Renders a login/logout button using Internet Identity, handling authentication state and errors.",
  "frontend/src/components/common/CompanyDetails.tsx": "Displays company email and address using brand configuration values.",
  "frontend/src/components/common/EmptyState.tsx": "Shows an icon, title, description, and optional action for empty or error states.",
  "frontend/src/components/contact/ContactForm.tsx": "Implements a contact form with fields, validation, success/error alerts, and submission via mutateAsync.",
  "frontend/src/components/contact/FloatingWhatsAppFab.tsx": "Floating WhatsApp button that opens a prefilled chat using brand config details.",
  "frontend/src/components/contact/WhatsAppButton.tsx": "A reusable WhatsApp support button that opens a prefilled chat message.",
  "frontend/src/components/jobs/FeaturedJobsSection.tsx": "Fetches and displays paginated active jobs with loading, error, and empty states.",
  "frontend/src/components/jobs/JobCard.tsx": "Card component showing job details and an Apply Now action.",
  "frontend/src/components/layout/Footer.tsx": "Footer with company info, links, social icons, and contact details using brand and copy config.",
  "frontend/src/components/layout/Header.tsx": "Header with navigation, admin checks, mobile menu, and auth controls.",
  "frontend/src/components/layout/SiteLayout.tsx": "Overall site layout including header, footer, and floating WhatsApp button.",
  "frontend/src/config/brand.ts": "Centralized branding, company info, contact details, social links, and document metadata.",
  "frontend/src/config/krStaffing.ts": "Legacy config wrapper that re-exports values from brandConfig for backward compatibility.",
  "frontend/src/content/copy.ts": "Defines UI copy text for the site including hero text, sections, testimonials, about info, and contact form strings, using brandConfig where needed.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useAdminJobs.ts": "Provides React Query hooks for admin job operations like add, update, activate, deactivate, seeding jobs, and fetching contact requests.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity React context and provider for authentication state, login, logout, and identity restoration.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for public and user-specific actions such as fetching active jobs, profiles, submitting contact forms, and checking admin status.",
  "frontend/src/index.css": "Tailwind CSS setup with custom CSS variables for themes and base styles, including dark mode tokens.",
  "frontend/src/lib/applyNow.ts": "Builds and opens a Google Form apply URL with optional prefilled jobTitle and city parameters.",
  "frontend/src/lib/categories.ts": "Defines job category metadata and helper functions to look up categories and labels from backend JobCategory values.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with company info, trust/compliance details, HR contact, roles, platforms, and sample document handlers.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard for managing jobs, seeding examples, editing entries, and viewing contact requests.",
  "frontend/src/pages/CategoriesPage.tsx": "Displays a grid of job categories and navigates to filtered job listings on click.",
  "frontend/src/pages/ContactPage.tsx": "Shows company details, WhatsApp support, and a contact form for user inquiries.",
  "frontend/src/pages/HomePage.tsx": "Provides the homepage with a hero search form, popular searches, categories, featured jobs, and contact options.",
  "frontend/src/pages/JobsPage.tsx": "Lists jobs with keyword, city, and category filtering, pagination, and error handling.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Displays the privacy policy content with heading and formatted paragraphs.",
  "frontend/src/pages/TermsPage.tsx": "Shows the terms and conditions content with headings and paragraph formatting.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routes), persist them in sessionStorage, and clear them from the URL hash.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, radii, shadows, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project’s current requirements, UI/UX goals, branding rules, known issues, and asset needs for KR Staffing."
}