{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "KR Staffing job portal (mobile-first) frontend",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Implement a consistent mobile-first KR Staffing theme (white base, red accent, neutral grays, modern typography, accessible contrast) across the app.",
      "acceptanceCriteria": [
        "All pages share a single coherent design system (colors, typography, spacing, buttons, cards).",
        "Primary actions (e.g., Find Jobs / Apply Now) use the red accent color and meet accessible contrast.",
        "Layouts adapt cleanly to small screens first; no horizontal overflow on common mobile widths."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "create",
          "description": "Create global styles and Tailwind layer tokens for KR Staffing (white background, red primary, neutral grays, readable typography, spacing rhythm) and set accessible defaults (focus rings, link styles)."
        },
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Adjust Tailwind theme tokens (CSS variables used by shadcn-ui) so `primary` maps to KR Staffing red and neutrals map to gray text/borders; keep mobile-first breakpoints consistent. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/layout/SiteLayout.tsx",
          "operation": "create",
          "description": "Add a shared layout wrapper applying consistent container widths, spacing, and background/typography across all pages."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Create a responsive site header/navigation with KR Staffing logo, required links, and optional Login/Register entry points that do not block job browsing.",
      "acceptanceCriteria": [
        "Header shows logo + the specified menu items.",
        "Navigation works on mobile (hamburger / drawer) and desktop.",
        "Login/Register entry points are visible but do not prevent browsing jobs when not logged in."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/Header.tsx",
          "operation": "create",
          "description": "Implement the header with logo and menu links (Home, Jobs, Categories, About Us, Contact Us, Apply Now), including a mobile drawer/hamburger. Use shadcn-ui components (e.g., Button, Sheet/Drawer, NavigationMenu) for accessible responsive nav. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/auth/AuthButtons.tsx",
          "operation": "create",
          "description": "Add optional Login/Register entry points using the existing Internet Identity hook (no blocking of public browsing); show Login/Logout behavior and keep UI consistent with theme. Use the selected 'authorization' component guidance for frontend auth UX. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "create",
          "description": "Wire the new Header into the global layout so it appears consistently on all pages (mobile and desktop)."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Build the homepage with all requested sections, trust-focused English copy, hero search routing to Jobs with filters, featured jobs with Load More, contact section, and footer links.",
      "acceptanceCriteria": [
        "Homepage contains all 9 sections in the order specified (may be visually rearranged for mobile, but all present).",
        "Hero search has fields for keyword and city and a Find Jobs button that takes the user to Jobs with filters applied.",
        "Featured Jobs renders job cards with Title, Location, Company, and Apply Now; Load More loads additional jobs without a full page refresh."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "create",
          "description": "Create the homepage implementing: Hero (heading/subheading, keyword+city search, Find Jobs), Popular Job Searches, Popular Job Categories, Featured Jobs (cards + Load More), Why Choose KR Staffing, Testimonials, Contact (WhatsApp support button + contact form), Footer (About/Quick links/Privacy/Terms/copyright). Use shadcn-ui components (Card, Button, Input, Textarea) for consistent UI. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/jobs/FeaturedJobsSection.tsx",
          "operation": "create",
          "description": "Implement Featured Jobs list using backend job data, rendering job cards with Apply Now and a client-side Load More (append results without full refresh), including loading and empty/error states. Use shadcn-ui Skeleton and Card. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/layout/Footer.tsx",
          "operation": "create",
          "description": "Implement footer with About snippet, quick links, Privacy Policy, Terms & Conditions, and social links (Instagram/WhatsApp channel) pulled from a single frontend config. Use shadcn-ui components for consistent typography and links. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add route for the homepage and ensure Home navigation points to it (and footer links route correctly)."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Implement Jobs listing page with keyword/city filters, job cards with Apply Now, and Load More pagination pattern with loading states.",
      "acceptanceCriteria": [
        "Jobs page supports filtering by keyword and city.",
        "Job cards show title, location, company, and Apply Now.",
        "Load More fetches the next page and appends results; a loading state is shown."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/JobsPage.tsx",
          "operation": "create",
          "description": "Create Jobs page with keyword + city filters, job results grid/list, and Load More behavior (client-side pagination by chunking results) with loading/skeletons, empty state, and error messaging. Use shadcn-ui Input, Button, Card, Skeleton. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/jobs/JobCard.tsx",
          "operation": "create",
          "description": "Create reusable job card UI showing title, location/city, company, and Apply Now action consistent with theme. Use shadcn-ui Card/Button. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useJobs.ts",
          "operation": "create",
          "description": "Add a React Query hook to fetch active jobs from the backend actor and provide client-side filtering (keyword/city/category) and stable loading/error states; avoid full reloads."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register the Jobs route and ensure header navigation points to it; support query-string driven filters (e.g., keyword/city/category)."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Implement Categories page listing provided categories and navigating to Jobs filtered by selected category with visible selection state.",
      "acceptanceCriteria": [
        "Categories page renders the listed categories as clickable items.",
        "Clicking a category navigates to Jobs filtered by that category.",
        "The selected category is reflected in the UI (e.g., filter pill or heading)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/CategoriesPage.tsx",
          "operation": "create",
          "description": "Create Categories page listing: Delivery, Sales Executive, Telecaller, Field Executive, Warehouse, Back Office, Marketing / Digital; clicking navigates to Jobs with category filter applied and reflects selection in UI. Use shadcn-ui Card/Button. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/lib/categories.ts",
          "operation": "create",
          "description": "Centralize the category list and mapping to backend JobCategory variants (including mapping for categories that are not explicit variants as `other`)."
        },
        {
          "path": "frontend/src/pages/JobsPage.tsx",
          "operation": "modify",
          "description": "Read category filter from navigation/query params and display the selected category in the UI (e.g., heading or filter pill) while applying filtering."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register Categories route and wire header navigation to it."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Add About Us, Contact Us, Privacy Policy, and Terms & Conditions pages with trust-building English copy and consistent responsive theme.",
      "acceptanceCriteria": [
        "Each page is reachable from header/footer links.",
        "Copy is clear and trust-focused and does not contain exaggerated guarantees.",
        "Pages are responsive and match the site theme."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AboutPage.tsx",
          "operation": "create",
          "description": "Create About Us page with simple trust-building English copy explaining KR Staffing’s process (search → apply → team contacts), avoiding unrealistic claims; match theme and mobile layout."
        },
        {
          "path": "frontend/src/pages/ContactPage.tsx",
          "operation": "create",
          "description": "Create Contact Us page with WhatsApp support CTA and the same contact form fields (name, mobile number, city, message), matching theme and responsive layout. Use shadcn-ui form inputs/buttons. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/PrivacyPolicyPage.tsx",
          "operation": "create",
          "description": "Create Privacy Policy page with clear English copy suitable for a job portal (data collected via forms, retention, user rights), avoiding guarantees."
        },
        {
          "path": "frontend/src/pages/TermsPage.tsx",
          "operation": "create",
          "description": "Create Terms & Conditions page with clear English copy (service nature, user responsibilities, limitations), avoiding unrealistic claims."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register routes for About, Contact, Privacy Policy, and Terms; wire header/footer links to these pages."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Implement Apply Now behavior to open a configurable Google Form URL in a new tab, optionally passing job title/city as prefill parameters.",
      "acceptanceCriteria": [
        "Apply Now opens a Google Form URL configured in the app (not hard-coded to an unknown value).",
        "Opens in a new tab and does not break SPA navigation.",
        "If prefill is configured, the job title/city are passed through correctly; otherwise it still opens the form."
      ],
      "file_operations": [
        {
          "path": "frontend/src/config/krStaffing.ts",
          "operation": "create",
          "description": "Add a single KR Staffing frontend configuration file containing the Google Form base URL and optional prefill query parameter keys for job title and city."
        },
        {
          "path": "frontend/src/lib/applyNow.ts",
          "operation": "create",
          "description": "Implement helper to build the Google Form URL from config and the job data (title/city), gracefully falling back to base URL when prefill is not configured."
        },
        {
          "path": "frontend/src/components/jobs/JobCard.tsx",
          "operation": "modify",
          "description": "Wire Apply Now button to open the configured Google Form URL in a new tab using the shared helper; ensure it does not disrupt SPA navigation."
        },
        {
          "path": "frontend/src/components/jobs/FeaturedJobsSection.tsx",
          "operation": "modify",
          "description": "Ensure Featured Jobs Apply Now actions use the same configured URL helper as the Jobs page."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Add WhatsApp click-to-chat button(s) and configurable Instagram/WhatsApp channel links, all managed from a single frontend config file.",
      "acceptanceCriteria": [
        "Clicking the WhatsApp button opens wa.me or api.whatsapp.com with the configured phone number/message.",
        "Instagram and WhatsApp channel links are visible and open the configured URLs.",
        "All social/contact URLs are stored in one configuration location and can be changed without touching multiple components."
      ],
      "file_operations": [
        {
          "path": "frontend/src/config/krStaffing.ts",
          "operation": "modify",
          "description": "Add configurable WhatsApp support phone/message and Instagram + WhatsApp channel URLs to the single KR Staffing config file."
        },
        {
          "path": "frontend/src/components/contact/WhatsAppButton.tsx",
          "operation": "create",
          "description": "Create a prominent WhatsApp click-to-chat button component that builds the correct wa.me/api.whatsapp.com link from config and opens it safely."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Add WhatsApp support button in the homepage Contact section using the shared WhatsAppButton component."
        },
        {
          "path": "frontend/src/components/layout/Footer.tsx",
          "operation": "modify",
          "description": "Add Instagram and WhatsApp channel links sourced from the single config file."
        },
        {
          "path": "frontend/src/components/contact/FloatingWhatsAppFab.tsx",
          "operation": "create",
          "description": "Optionally add a floating WhatsApp action button for mobile-friendly support access, configurable via the same config."
        },
        {
          "path": "frontend/src/components/layout/SiteLayout.tsx",
          "operation": "modify",
          "description": "Wire the optional floating WhatsApp action button so it appears consistently without breaking layout or causing mobile overflow."
        }
      ]
    },
    {
      "id": "REQ-10",
      "summary": "Build admin job management UI gated by Internet Identity with an admin-only guard and admin actions for add/edit jobs (and basic activation toggles if available).",
      "acceptanceCriteria": [
        "Non-authenticated users cannot access admin create/edit actions (UI and backend enforce this).",
        "Authenticated admin can create a new job and see it appear on Jobs and Featured Jobs.",
        "Authenticated admin can edit an existing job and see updates reflected on public pages."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/admin/AdminDashboardPage.tsx",
          "operation": "create",
          "description": "Create an admin dashboard page with job management UI (list jobs, create job, edit job, optional activate/deactivate) using backend actor capabilities; keep UX admin-friendly and mobile-responsive. Use shadcn-ui Form/Input/Select/Dialog components for accessible editing. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/admin/AdminRouteGuard.tsx",
          "operation": "create",
          "description": "Implement a route guard that requires Internet Identity login and checks admin status via backend actor; show an Access Denied view for unauthorized users. Use the selected 'authorization' component guidance for admin-only UI gating. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/admin/JobEditorDialog.tsx",
          "operation": "create",
          "description": "Create add/edit job form UI (title, company, city, category, description, optional salary/type) in a dialog/sheet; integrate with backend actor methods to add/update. Use shadcn-ui Dialog/Sheet + form controls. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useAdminJobs.ts",
          "operation": "create",
          "description": "Add React Query hooks/mutations for admin job operations (fetch job list for admin view, add/update, activate/deactivate if used) with error handling and cache invalidation so public pages refresh."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register an admin route and wrap it with AdminRouteGuard; add optional header entry (e.g., 'Admin') that appears only when the user is authenticated and recognized as admin."
        },
        {
          "path": "frontend/src/components/auth/AuthButtons.tsx",
          "operation": "modify",
          "description": "Ensure login/logout clears cached queries on logout (so admin data is not shown after logout) using React Query client, following the selected 'authorization' component guidance. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-11",
      "summary": "Implement homepage Contact form to submit inquiries to backend and provide an admin read-only inquiries list view.",
      "acceptanceCriteria": [
        "Submitting the contact form shows success/error states and does not reload the page.",
        "Inquiry data is persisted in the backend.",
        "Admin can view a list of submitted inquiries in the admin UI."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/contact/ContactForm.tsx",
          "operation": "create",
          "description": "Create contact form component (name, mobile number, city, message) with client-side validation, submit via backend actor, and success/error states without page reload. Use shadcn-ui Input/Textarea/Button and inline error messaging. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Wire ContactForm into the homepage Contact section and ensure it matches the trust-focused tone and theme."
        },
        {
          "path": "frontend/src/hooks/useContactRequests.ts",
          "operation": "create",
          "description": "Add React Query mutation for submitting contact requests and admin-only query for listing contact requests in the admin area, with graceful error handling."
        },
        {
          "path": "frontend/src/components/admin/ContactRequestsList.tsx",
          "operation": "create",
          "description": "Create a read-only admin list view for submitted inquiries (name, mobile, city, message, id) with loading/empty/error states. Use shadcn-ui Table/Card/Skeleton. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/admin/AdminDashboardPage.tsx",
          "operation": "modify",
          "description": "Add an admin section/tab for viewing contact inquiries (read-only), using the ContactRequestsList component."
        }
      ]
    },
    {
      "id": "REQ-12",
      "summary": "Add performance and UX basics: skeleton/loading states, empty states, and clear error messaging; keep navigation simple and consistent.",
      "acceptanceCriteria": [
        "Jobs/Featured Jobs show loading indicators and handle errors gracefully.",
        "When no results match filters, an empty state is shown with guidance to change filters.",
        "Key pages score well on basic Lighthouse-style checks (no major layout shift, images optimized, minimal blocking UI)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ui/EmptyState.tsx",
          "operation": "create",
          "description": "Create a reusable empty-state presentation component (message + optional action) used by Jobs and Featured Jobs; compose with existing shadcn-ui primitives (do not modify frontend/src/components/ui). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/JobsPage.tsx",
          "operation": "modify",
          "description": "Add skeleton loading, inline error banner, and no-results empty state guidance; ensure Load More shows a loading state and is disabled while loading."
        },
        {
          "path": "frontend/src/components/jobs/FeaturedJobsSection.tsx",
          "operation": "modify",
          "description": "Add skeleton loading, error messaging, and empty state for Featured Jobs; ensure Load More does not cause layout shift."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Ensure hero illustration is loaded as a static optimized asset with appropriate sizing and does not introduce major layout shift on mobile."
        }
      ]
    },
    {
      "id": "REQ-13",
      "summary": "Ensure all user-facing text is English, trust-building, and explains the application process without unrealistic promises; testimonials are realistic.",
      "acceptanceCriteria": [
        "No Hindi/mixed-language copy is shown in the UI; all visible UI strings are English.",
        "Copy explains the process (search jobs → apply via form → staffing team contacts) without guarantees.",
        "Testimonials read as realistic, short success stories (no extreme claims)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/content/copy.ts",
          "operation": "create",
          "description": "Centralize English UI copy (headings, button labels, testimonials, process explanation text) to ensure consistency and easy review."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Update homepage strings to use centralized English copy, including realistic testimonials and clear process explanation."
        },
        {
          "path": "frontend/src/pages/AboutPage.tsx",
          "operation": "modify",
          "description": "Ensure About page copy is concise, English-only, and avoids unrealistic guarantees; reference centralized copy where helpful."
        },
        {
          "path": "frontend/src/pages/ContactPage.tsx",
          "operation": "modify",
          "description": "Ensure Contact page labels/messages are English-only, trust-focused, and consistent with centralized copy."
        }
      ]
    },
    {
      "id": "REQ-14",
      "summary": "Wire generated brand images (logo, favicon, hero illustration) as static assets served from frontend/public/assets/generated.",
      "acceptanceCriteria": [
        "Logo renders in the header in appropriate sizes for mobile/desktop.",
        "Favicon is set and visible in the browser tab.",
        "Assets are referenced from frontend/public/assets/generated (not fetched from backend)."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/kr-staffing-logo.dim_512x128.png",
          "operation": "create",
          "description": "Add the generated KR Staffing wordmark logo as a static public asset at the exact path: frontend/public/assets/generated/kr-staffing-logo.dim_512x128.png."
        },
        {
          "path": "frontend/public/assets/generated/kr-staffing-favicon.dim_128x128.png",
          "operation": "create",
          "description": "Add the generated favicon as a static public asset at the exact path: frontend/public/assets/generated/kr-staffing-favicon.dim_128x128.png."
        },
        {
          "path": "frontend/public/assets/generated/hero-illustration.dim_1200x600.png",
          "operation": "create",
          "description": "Add the generated hero illustration as a static public asset at the exact path: frontend/public/assets/generated/hero-illustration.dim_1200x600.png."
        },
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Set the favicon link to reference frontend/public/assets/generated/kr-staffing-favicon.dim_128x128.png and keep title/meta intact."
        },
        {
          "path": "frontend/src/components/layout/Header.tsx",
          "operation": "modify",
          "description": "Render the logo image from frontend/public/assets/generated/kr-staffing-logo.dim_512x128.png with responsive sizing and accessible alt text."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Render the hero illustration from frontend/public/assets/generated/hero-illustration.dim_1200x600.png in the hero section with responsive layout and appropriate alt text."
        }
      ]
    }
  ]
}